import React from 'react'

function AboutUs() {
  return (
    <div className="container">
        <h2 className='about-title'>About us</h2>
        <p className="text_about">Ми - студенти УжНУ факультету інформаційних технологій. Даний навчальний портал був розроблений нами в рамках курсової роботи. Наш шлях в університеті розпочався одразу з дистанційної форми навчання, тому ми розуміємо, наскільки це важливо мати доступ до необхідної інформації. Ми сподіваємось, що розроблений нами ресурс допоможе вам у вивченні та засвоєнні веб-технологій.</p>
    </div>
  )
}

export default AboutUs